class ErrorText {
  /// Ошибка загрузки, попробуйте повторить позже или обратитесь к разработчику!
  static const loadFailure =
      'Ошибка загрузки, попробуйте повторить позже или обратитесь к разработчику!';

  /// Ошибка удаления дома, обратитесь к разработчику
  static const houseDeleteFailure =
      'Ошибка удаления дома, обратитесь к разработчику';

  /// Ошибка обновения информации о доме, обратитесь к разработчику
  static const houseUpdateFailure =
      'Ошибка обновения информации о доме, обратитесь к разработчику';

  /// Ошибка добавления члена совета дома, обратитесь к разработчику
  static const houseCouncilMemberAddFailure =
      'Ошибка добавления члена совета дома, обратитесь к разработчику';

  /// Ошибка удаления члена совета дома, обратитесь к разработчику
  static const houseCouncilMemberDeleteFailure =
      'Ошибка удаления члена совета дома, обратитесь к разработчику';

  /// Ошибка обновления члена совета дома, обратитесь к разработчику
  static const houseCouncilMemberUpdateFailure =
      'Ошибка обновления члена совета дома, обратитесь к разработчику';

  /// Заполните все поля
  static const houseCouncilMemberRequiredFields = 'Заполните все поля';

  /// Заполните все поля
  static const staffRequiredFields = 'Заполните все поля';

  /// Заполните название контрагента
  static const partnerRequiredFields = 'Заполните название контрагента';

  /// Введите текст сообщения
  static const enterHouseMessage = 'Введите текст сообщения';

  /// Ошибка удаления контрагента, обратитесь к разработчику
  static const partnerDeleteFailure =
      'Ошибка удаления контрагента, обратитесь к разработчику';

  /// Ошибка удаления сотрудника, обратитесь к разработчику
  static const staffDeleteFailure =
      'Ошибка удаления сотрудника, обратитесь к разработчику';

  /// Ошибка обновления сотрудника, обратитесь к разработчику
  static const staffUpdateFailure =
      'Ошибка обновления сотрудника, обратитесь к разработчику';

  /// Ошибка добавления сотрудника, обратитесь к разработчику
  static const staffAddFailure =
      'Ошибка добавления сотрудника, обратитесь к разработчику';
}
