/// Strore String values for printing views
class PrintString {
  /// Наряд-задание по заявке №
  static const workOrderForRequest = 'Наряд-задание по заявке №';

  /// тел. диспетчера 52-40-42
  static const operatorPhone = 'тел. диспетчера 52-40-42';

  /// (акт выполненных работ)\nна выполнение работ (ликвидацию аварийных ситуаций) по обслуживанию и ремонту
  /// общедомового имущества, на выполнение работ (ликвидацию аварийных ситуаций) по обслуживанию внутриквартирных
  /// инженерных коммуникаций
  static const workOrderSubtitle = '''
 (акт выполненных работ)\nна выполнение работ (ликвидацию аварийных ситуаций) по обслуживанию и ремонту
  общедомового имущества, на выполнение работ (ликвидацию аварийных ситуаций) по обслуживанию внутриквартирных инженерных коммуникаций
  ''';

  /// от
  static const from = 'от';

  /// кв.№
  static const flatNumberShort = 'кв.№';

  /// тел.№ +7
  static const phoneNumberShort = 'тел.№ +7';

  /// Сальдо по л/с:
  static const debt = 'Сальдо по л/с:';

  /// руб.
  static const roubles = 'руб.';

  /// Наряд - задание выдал диспетчер:
  static const workOrderOperator = 'Наряд - задание выдал диспетчер:';

  /// 'Фактическое выполнение работ на объекте: с _____:_____ до _____:_____ "___"_______________20____г.'
  static const requestEndTime =
      'Фактическое выполнение работ на объекте: с _____:_____ до _____:_____ "___"_______________20____г.';

  /// Наименование вида работы (услуги)
  static const workOrderJobTitle = 'Наименование вида работы (услуги)';

  /// Периодичность/колличественный показатель выполненной работы (оказанной услуги)
  static const workOrderMeasure =
      'Периодичность/колличественный показатель выполненной работы (оказанной услуги)';

  /// Единица измерения работы (услуги)
  static const workOrderUnit = 'Единица измерения работы (услуги)';

  /// В том числе произведен осмотр общедомовых инженерных коммуникаций и строительных конструкций
  static const workOrderCommunication =
      'В том числе произведен осмотр общедомовых инженерных коммуникаций и строительных конструкций';

  /// Описание состояния, выявленные нарушения
  static const workOrderStatusDescription =
      'Описание состояния, выявленные нарушения';

  /// ХВС, ГВС, отопление и канализация
  static const workOrderWater = 'ХВС, ГВС, отопление и канализация';

  /// Электроснабжение
  static const workOrderElectricity = 'Электроснабжение';

  /// Строительные конструкции (лестничные марши, кровля, входные группы и т.д.)
  static const workOrderBuildingConstruction =
      'Строительные конструкции (лестничные марши, кровля, входные группы и т.д.)';

  /// Придомовая территория, МАФ, урны и т.д.
  static const workOrderHouseArea = 'Придомовая территория, МАФ, урны и т.д.';

  /// Проверка вентилляции
  static const workOrderVentilation = 'Проверка вентилляции';

  /// (Не) соответствует нормативу
  static const workOrderValidation = '(Не) соответствует нормативу';

  /// Подпись исполнителя __________________________________/__________________________________/
  static const contractorSign =
      'Подпись исполнителя __________________________________/__________________________________/';

  /// Подпись заявителя __________________________________ кв.№ ______/__________________________________/
  static const ownerSign =
      'Подпись заявителя __________________________________ кв.№ ______/__________________________________/';

  /// Используемые материалы
  static const workOrderMaterials = 'Используемые материалы';

  /// Количество
  static const workOrderAmount = 'Количество';

  /// Заявитель: _______________________________________ кв.№ ______/_______________________________________/\n
  ///                                      (Фамилия, инициалы)                                                              (Подпись)
  static const ownerEndSign = '''
  Заявитель: _______________________________________ кв.№ ______/_______________________________________/\n
                       (Фамилия, инициалы)                                     (Подпись)
  ''';

  /// Ваш отзыв, пожелания:
  static const workOrderFeedback = 'Ваш отзыв, пожелания:';

  /// Код
  static const logCode = 'Код';

  /// Вид работ
  static const logJobType = 'Вид работ';

  /// Дата поступления заявки
  static const logRequestDate = 'Дата поступления заявки';

  /// Плановая дата исполнения заявки
  static const logResponseDate = 'Плановая дата исполнения заявки';

  /// ФИО Заявителя
  static const logOwner = 'ФИО Заявителя';

  /// Адрес (улица дом)
  static const logAddress = 'Адрес (улица дом)';

  /// № кв-ры
  static const logFlatNumber = '№ кв-ры';

  /// Телефон
  static const logPhoneNumber = 'Телефон';

  /// Описание заявки
  static const logRequestDescription = 'Описание заявки';

  /// Исполнитель
  static const logStaff = 'Исполнитель';

  /// Дата фактического выполнения заявки
  static const logRequestCloseDate = 'Дата фактического выполнения заявки';

  /// Отметка о выполнении или переносе
  static const logCloseOrShiftMark = 'Отметка о выполнении или переносе';

  /// Подпись
  static const logSign = 'Подпись';

  /// Не определен
  static const logNoStaff = 'Не определен';

  /// Дата:
  static const logDate = 'Дата:';

  /// Дипетчер:
  static const logOperator = 'Дипетчер:';

  /// стр.
  static const logPage = 'стр.';

  /// Название компании
  static const title = 'Управляющая компания';

  /// Наряд-задание
  static const workOrder = 'Наряд-задание';

  /// Заявка №
  static const requestNumber = 'Заявка №';

  /// Адрес
  static const requestAddress = 'Адрес';

  /// Описание заявки
  static const requestDetails = 'Описание заявки';

  /// Заявитель
  static const requestOwner = 'Заявитель';

  /// Исполнитель
  static const staff = 'Исполнитель';
}
